# ContinuousrailEndTopExtension Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
GroupTypeId..::..ContinuousrailEndTopExtension Property
GroupTypeId Class See Also
---
"Extension (End/Top)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ContinuousrailEndTopExtension { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContinuousrailEndTopExtension As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ContinuousrailEndTopExtension {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace